[
  {
    "path": "projects/2021-01-29-tadpoles/",
    "title": "The Tadpole Olympics",
    "description": "For my B.S. thesis project at Yale, I measured how fast wood frog tadpoles swim in response to a simulated predator attack, and how that swimming speed relates to their developmental rate. It turns out that developing fast comes with a performance cost, and that tradeoff might help to explain some of the patterns we've observed in wood frogs' developmental rates in the past.\nA short description of the post.",
    "author": [
      {
        "name": "Kaija Gahm",
        "url": {}
      }
    ],
    "date": "2021-01-29",
    "categories": [],
    "contents": "\nIntroduction\nFor my senior (B.S.) thesis in E&EB at Yale, I studied a tradeoff between growth rate and swimming performance in wood frog tadpoles.\nWhat does that mean? Basically, my collaborator Andis and I raised tadpoles in the lab under warm and cold conditions. Since frogs are cold-blooded, the warm tadpoles grew faster than the cold tadpoles.\nOn the one hand, growing rapidly is good for animals like wood frogs, who need to escape from predators and compete for mating opportunities. But when we stuck our tadpoles into an arena and tested how fast they swam, we found that the tadpoles pay a cost for that fast growth. The fast-growing (warm) tadpoles didn’t perform as well in their swimming trials as the slow-growing (cold) tadpoles.\nThis kind of tradeoff exists in other animals too, but we tested several populations of tadpoles and found that the effect was really consistent, no matter which population the tadpoles came from.\nWhat determines how fast a tadpole grows?\nWhy is this important? Well, our findings might help to explain a pattern that my lab has been wondering about for a while, called “countergradient variation”. Here’s how it works. We know that growing fast is helpful to tadpoles for a lot of reasons: they might have better mating or survival success as adults (though we don’t know this for sure); they might get too big for aquatic predators to eat while they’re still tadpoles; they can be sure to leave their ephemeral ponds before the water dries up in the summer; and they can get a head start on terrestrial life, perhaps outcompeting slower-growing tadpoles.\nTwo factors can help frogs grow fast: 1) environmental factors, like the temperature of the water they live in, and 2) genetic factors: that is, their genes can predispose them to “intrinsically” fast growth, independent of their environment.\nLet’s say we have two ponds in an imaginary forest, called “Fire Pond” and “Ice Pond” because one has really warm water and the other has really cold water.\nEnvironmental factors\nWe know that the tadpoles living in Fire Pond will grow faster than the tadpoles living in Ice Pond, since frogs are cold-blooded and their growth is pretty heavily influenced by the temperature of the water around them. Warmer water -> faster growth! This is the relationship that we made use of to manipulate our frogs’ developmental rates in the lab.\nGenetic factors\nFire Pond and Ice Pond are pretty far apart, and wood frogs tend to return to the same ponds where they grew up to breed. So, the frog populations in Fire and Ice can evolve roughly independently of each other.\nSo, if fast growth is unequivocally beneficial, then we might expect that both the Fire and Ice populations would evolve toward faster intrinsic growth and development. Put another way: natural selection would favor tadpoles that had genes for fast growth over those who grew more slowly, independent of the surrounding water temperature. We would expect to see this evolutionary trend in both ponds. Tadpoles from both Fire and Ice would evolve fast intrinsic growth rates, such that the Ice tadpoles will grow fast despite the cold water, and the Fire tadpoles will grow EXTRA FAST from the combined effects of genetics and warm water.\nBut this pattern is not what researchers, including the Skelly lab, have observed! When other studies have taken tadpoles from Fire and Ice and reared them at the same temperature (so, removing the effects of the different pond temperatures), they find that tadpoles from Fire grow more slowly than tadpoles from Ice. So, for some reason, those Fire frogs aren’t evolving to grow super fast intrinsically, even though doing so would let them have an edge over the chilly little Ice frogs.\nPutting it together\nThe pattern that I’ve described above is called “countergradient variation” because the frogs’ intrinsic (genetic) growth rates run in the opposite direction (counter-gradient) as their environmental circumstances.\nFor a while, we’ve wondered why we see this pattern. Why don’t the Fire tadpoles make the most of what seems like an advantage: their warm water? The countergradient pattern suggests that there must be a tradeoff, something that makes growing EXTRA FAST not quite so advantageous after all.\nThat’s where my study comes in. It turns out, growing fast comes with a cost in burst swimming speed! If you’re a tadpole, you might get bigger faster, but if you also swim more slowly than your slower-growing peers, you’re at risk of getting gobbled up by a predator. If that happens, all that growing would be for nothing.\nPaper\nMy collaborators and I published this work, and if you want to read more, you can rxfun::embed_file(text = “download the paper”, ‘Gahm_etal_2020.pdf’)`. But I hope my description is a little easier to get through than the paper itself.\nIf you want a more detailed summary of the paper, with reference to each of its figures, Andis did a great job explaining it in his blog post.\nTalk\nIf you want to learn more about my work and would prefer to see a video of a talk I gave, aimed at a more general audience than the published paper, you can watch it below. This talk was given as part of the 2020 end-of-year E&EB Senior Symposium, which I organized as a remote event due to the COVID-19 pandemic.\n\n\nAcknowledgements and reflections\nThis work was made possible with the tremendous support of the Skelly Lab in the Yale School of the Environment. Andis Arietta, in particular, was a great mentor and collaborator. You should check out his research on his website and follow him on Twitter.\nThanks to Kirby Broderick and Simon Stump for help with the MATLAB code I wrote to analyze all my tadpole videos. Thanks to Joaquin Bellomio for help ground-truthing videos, and to Adriana Rubinstein and David Skelly for assistance in the lab.\nFinally, I want to recognize the privilege that allowed me to publish my research in 2020. Apart from summer fellowships, Yale doesn’t pay undergrads for research hours beyond course credit. I was able to spend a lot of extra hours in the lab during my senior year, hours that were not an option for a lot of my fellow students because they had to prioritize fulfilling their student income contributions (SIC) or working to support their families. Yale needs to abolish the SIC (SUN at Yale is doing great work toward this end) and pay undergraduate researchers to help even out these opportunities.\nWhen the COVID-19 pandemic hit, I was able to return to a calm and supportive home environment, where I had lots of time to work on preparing this manuscript for publication. Many of my friends had their thesis work cut short, and they had far more pressing things on their minds than writing and publishing papers. Across the scientific community, some academics are publishing more under lockdowns, while others (disproportionately women, people of color, those caring for children, etc.–aka people who were already at a disadvantage before this pandemic made things worse) have less time, not more, to devote to their work (see this and this, although this calls things into question. I don’t have good data for disparities by race and family status, and if/when I find papers that support/refute my intuition above, I’ll change my view accordingly!).\nI hope that in the coming years, we will see academia recognize that traditional metrics of success, like publication numbers and grant awards, are far from equitable, especially in the wake of this troubled year.\nThank you for reading, and if you have any questions about my work, please feel free to reach out!\n\n\n\n",
    "preview": "projects/2021-01-29-tadpoles/tadpole.png",
    "last_modified": "2021-02-03T18:29:15-05:00",
    "input_file": "tadpoles.utf8.md",
    "preview_width": 1421,
    "preview_height": 575
  },
  {
    "path": "projects/2021-01-29-ygdp-dashboard/",
    "title": "YGDP Dashboard",
    "description": "From June through December 2020, I taught myself Shiny and ended up creating a pretty complicated interactive dashboard for exploring dialect variation across the US. Here's a bit about my experience using Shiny, as well as the app itself for you to play around with.",
    "author": [
      {
        "name": "Kaija Gahm",
        "url": {
          "https://kaijagahm.shinyapps.io/ygdpDashboard/": {}
        }
      }
    ],
    "date": "2021-01-29",
    "categories": [],
    "contents": "\nA map showing interpolated ratings data for the sentence “Here’s you some money.” A rating of 1 is “totally unacceptable sentence, even in casual conversation”, while 5 is “totally acceptable sentence.”Studying language across the US\nThe Yale Grammatical Diversity Project (YGDP) has been collecting survey data about syntax diversity in U.S. English for over five years.\nYou can read about the YGDP’s work here, but in a nutshell:\nWe put out surveys online to learn about people’s dialects across the United States\nWe ask survey participants to judge whether test sentences, such as “Here’s you a piece of pizza”, seem acceptable in casual conversation.\nWe’re not interested in “proper” or “correct” English–we want to know how people actually talk in real life across the country.\n(If you want to learn about the survey and data analysis methods in great detail, check out the comprehensive mapbook that we published earlier this year.)\nIn the past, there has been a lot of research into regional language diversity, but a lot of it has focused on lexical (words, vocabulary) diversity. A great example of that is the New York Times dialect quiz, which asks questions like “What do you call it when rain falls while the sun is shining?”, with answers ranging from “sunshower” to “the wolf is giving birth”.\nThe YGDP focuses more on syntactic (“grammatical”; related to syntax) diversity. So, they want to know how people put sentences together, not necessarily which words they use.\nThe Scots Syntax Atlas has done some great work along these lines in Scotland. The YGDP’s methods are a little different, but they’re asking the same types of questions about grammatical variation.\nI’m actually not a linguist, so I’m not going to explain the research in detail. To learn more about the YGDP’s research, you can check out their website. Head over to the grammatical phenomena pages to learn more about constructions like “All the further”, “Done my homework”, and “Come with”.\nData work\nIn 2019, I started working with the YGDP to pull together and organize their survey data. One of our primary goals was to make our findings easily accessible and explorable for anyone who might be interested.\nI had heard about R Shiny, but I had never created a Shiny app. In the spring of 2020, I talked to Jim Wood, one of the YGDP’s supervisors, about the possibility of developing a Shiny app to display the YGDP’s findings in a colorful, interactive way. Jim was excited about the idea, even though I had been very clear that I’d be starting absolutely from scratch and learning Shiny along the way.\nFrom June through December 2020, I dove in headfirst. I created a couple simple Shiny apps as practice, but then I set about developing a pretty complicated Shiny dashboard. I’ve always found that the best way to learn a new tool is to plunge in and use it, learning as you go. Learning Shiny was the ultimate baptism by fire. I think I started trying to create hierarchical selectInputs by about day 2, when I was still far from understanding the fundamentals of Shiny’s inputs and outputs. Next came the dashboard layout, which I achieved using shinydashboard and eventually shinydashboardPlus. I learned to insert a map using leaflet, another package I had never dabbled in.\nHierarchical selectInputs: the choices in the “Sentence 1” menu depend on the selection in “Survey”.A map made with the leaflet packageThe dashboard is still evolving, but here is the current version. I’m immensely proud of how far I’ve come with Shiny, and I’m really excited about how this dashboard will allow the YGDP, and the general public, to explore the linguistic survey data in great detail.\n\n\nIf you have questions about this work, please feel free to get in touch. If you want to suggest an improvement or change to the dashboard, or to report a bug or file a pull request, head over to the github page for the project. I’ll be leaving the project shortly, so I’m not sure how actively the dashboard will be maintained, but suggestions are certainly welcome.\n\n\n\n",
    "preview": "projects/2021-01-29-ygdp-dashboard/hexMap.png",
    "last_modified": "2021-02-03T18:58:20-05:00",
    "input_file": "ygdp-dashboard.utf8.md",
    "preview_width": 1434,
    "preview_height": 810
  }
]
